# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [16, 3]],  # 0-P1/2 0
   [-1, 1, ASIR_Block_2, [16]],#1
   [-1, 1, ASIR_Block_1, [16]],#2
   [-1, 1, ASIR_Block_2, [32]],#3
   [-1, 1, ASIR_Block_1, [32]],#4
   [-1, 1, Channel_Attention, [32]],#5
   [-2, 1, ASIR_Block_2, [64]],#6
   [-1, 1, ASIR_Block_1, [64]],#7
   [-1, 1, Channel_Attention, [64]],#8
   [-2, 1, ASIR_Block_2, [128]],#9
   [-1, 1, SPP, [128, [3, 7, 11]]],#10
   [-1, 1, ASIR_Block_1, [128]],#11
  ]

head:
  [[-1, 1, Conv, [64, 1, 1]],#12
   [-1, 1, Channel_Attention, [64]],#13
   [-2, 1, nn.Upsample, [None, 2, 'nearest']],#14
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4 #15
   [-1, 1, ASIR_Block_1, [64, False]],#16

   [-1, 1, Conv, [64, 1, 1]],#17
   [-1, 1, Channel_Attention, [64]],#18
   [-2, 1, nn.Upsample, [None, 2, 'nearest']],#19
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3 #20
   [-1, 1, ASIR_Block_1, [64, False]],#21

   [-1, 1, ASIR_Block_2, [128]],#22
   [[-1, 18], 1, Concat, [1]],  # cat head P4 23
   [-1, 1, ASIR_Block_1, [128, False]],#24

   [-1, 1, ASIR_Block_2, [128]],#25
   [[-1, 13], 1, Concat, [1]],  # cat head P5 26
   [-1, 1, ASIR_Block_1, [256, False]], #27

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
